# IMPORT LIBRARIES
import numpy as np
import pandas as pd


# INPUT FILE (CHANGEABLE)
input_files = '../../STAGE 1 - Data Collection/Datasets/(12) December/AirBnB_Riyadh_(12)December_Bedroom(3).xlsx'
df = pd.read_excel(input_files)

# DATAFRAME CONTAINS RIYADH DISTRICT
riyadh_district = [
    "طويق", "غرناطة", "حطين", "إشبيلية", "مطار الملك خالد الدولي", "الهدا", "الرائد", "قرطبة", "العارض",
    "المنار", "الملز", "الملقا", "المغرزات", "المصيف", "العمارية", "المونسية", "النهضة", "الغدير", "القيروان",
    "التخصصي", "الريان", "الروابي", "الربوة", "الروضة", "الوادي", "الياسمين", "اليرموك", "النخيل", "المحمدية",
    "الشهداء", "الصحافة", "العقيق", "البديعة", "التعاون", "الحمراء", "الربيع", "السويدي", "النزهة", "الفلاح",
    "الرحمانية", "الروضة", "السليمانية", "العليا", "الرمال", "القدس", "الندى", "عرقة", "المروج", "الازدهار",
    "النرجس",
]

# DATAFRAME CONTAINS CORRECTION OF TYPO
typo = {
    "Dahrat Laban": "حي ظهرة لبن",
    "Binban": "حي بنبان",
    "As-Sulaimanyah": "حي السليمانية",
    "An-Nafel": "حي النفل",
    "Mugharazat": "حي المغرزات",
    "Ramah": "حي الرماح",
    "Yarmuk": "حي اليرموك",
    "Hitteen": "حي حطين",
    "As-Sahafa": "حي الصحافة",
    "Malqa": "حي الملقا",
    "Al Yasmeen": "حي الياسمين",
    "Almalqa": "حي الملقا",
    "العريض": "حي العارض",
    "النرجيس": "حي النرجس",
    "يارموك": "حي اليرموك",
    "الملاكا": "حي الملقا",
    "النزهه": "حي النزهة",
    "القيروان": "حي القيروان",
    "لبن": "حي ظهرة لبن"
}

# FUNCTION TO REMOVE "SR" AND "," FROM PRICE
def clean_price(price):

    if isinstance(price, str):
        cleaned_price = price.replace("SR", "").replace(",", "")
        return cleaned_price.strip()
    else:
        return price

# FUNCTION TO COVERT DISTRICT IF IT'S CONTAINS IN THE DATAFRAME (riyadh_district) WHETHER DISTRICT OR NAME
def clean_district(row):

    district = row['District']
    name = row['Name']

    if pd.isna(district):
        return np.nan

    # GET DISTRICT FROM DATAFRAME
    for district_list in [riyadh_district]:
        for item in district_list:
            if item in district or item in name:
                return f"حي {item}"

    # FIX TYPO
    for original_key, corrected_value in typo.items():
        if original_key in district or original_key in name:
            return corrected_value

    # REPLACE DATA MANUALLY IN FILE
    الورود = {
        "شقة جديدة", "Almajdiah Apt. 5 | تسجيل الوصول الذاتي",
    }
    for item in الورود:
        return "حي الورود"

    قرطبة = {
        "شقة حديثة ومريحة - 2", "شقة فندقية بتصميم مودرن وكن21", "تسجيل دخول ذاتي استوديو فاخر بالقرب من ParkAvenue mall",
        "شقة خاصة فاخرة/ذاتي/بلكونة/موقف أرضي", "استديو فندقي (2/A)", "Swimmingpool Penthouse selflogin",
        "شقة فاخرة/بشرفة/بدخول ذاتي (411)", "شقه مودرن", "غرفتين وصالة دخول ذاتي Two Bedroom Apartment",
        "شقة بتصميم جميل في مجمع العجلان", "حمام سباحة وسينما بنتهاوس", "شقة مميزة / بدخول ذاتي / 404",
        "شقة فاخرة بمسبح ونادي رياضي", "شقة مميزة/ بدخول ذاتي",
    }
    for item in قرطبة:
        return "حي قرطبة"

    الرمال = {
        "شاليه مريح مع حمام سباحة واسع", "شقه طابقين فاخرة بمسبح خاص (1)", "فلة مودرن مدخل خاص للسيارة وحديقة خارجية ومسبح خاص",
        "فلة مودرن مدخل خاص للسيارة وحديقة خارجية ومسبح خاص", "شقة بطابقين مدخل خاص (3)",
    }
    for item in الرمال:
        return "حي الرمال"

    الرماح = {
        "شاليه لاهل الذوق",
    }
    for item in الرماح:
        return "حي الرماح"

    الملقا = {
        "شقة فاخرة مكونة من 3 غرف نوم مع نجاح ذاتي", "bnbmehomes | Suite nr Boulevard Riyadh City", "شقة مريحة مع 3 غرف نوم /تسجيل وصول ذاتي",
        "إقامات في المستقر | شقة فاخرة - F9|المجدية 127", "شقه فندقيه vip في شمال الرياض", "شقة مودرن بثلاث غرف و صالة 16",
        "الجوري ريزدنس", "شقة القرية تسجيل الوصول الذاتي", "شقة فاخره ٣ غرف نوم مدخل خاص", "تسجيل وصول ذاتي لشقة فاخرة",
        "نزل لولوهـ مسكن أنيق ومثالي.", "إقامات في المستقر | شقة فاخرة - M2|المجدية 127", "lUXURY APARTMEN، بوليفارد",
        "شقة مميزة بجاكوزي ومدخل خاص ذاتي", "تسجيل وصول ذاتي لشقة فاخرة", "HighRise - شقة أنيقة", "الجادة |55| Blvd",
        "KAGE.1 شقة مع مدخل خاص - شقة بمدخل خاص", "New Spacious Place In Talid Compound", "شقة صالة وثلاث غرف نوم",
        "شقة الماجدية فاخرة مؤثثة اثاث جديد", "Livedin | شقة عصرية بغرفة نوم واحدة بالقرب من بوليفارد",
    }
    for item in الملقا:
        return "حي الملقا"

    الصحافة = {
        "شقة فاخره بدخول ذاتي بالكونه 360", "6A مكان للراحة والهدوء", "شقة فاخرة مطلة على المدينة برج رافال دخول ذاتي",
        "شقة فاخرة في برج جلامور",
    }
    for item in الصحافة:
        return "حي الصحافة"

    المغرفية = {
        "مزرعة واستراحة باطلالة على الجبل",
    }
    for item in المغرفية:
        return "حي المغرفية"

    الازدهار = {
        "شقة بثلاث غرف نوم - دخول ذكي Luxury Apartment 10", "شقه بثلاث غرف نوم - دخول ذكي Luxury Apartment 13",
        "شقة بثلاث غرف نوم - دخول ذكي | Luxury Apartment 8", "شقه بثلاث غرف نوم- دخول ذكي Luxury Apartment 5",
        "A2 - شقة فاخرة، مدخل ذاتي", "A -5 شقة فاخرة حديثة", "شقة فاخرة دخول ذاتي", "A -4 شقة فاخرة حديثة",
        "A -14 شقة فاخرة حديثة", "A -10 شقة فاخرة حديثة", "شقه بثلاث غرف نوم - دخول ذكي Luxury Apartment 2",
    }
    for item in الازدهار:
        return "حي الازدهار"

    السويدي = {
        "منتجع رواف ريزورت", "شقة رومانسية بفناء خارجي ودخول ذكي", "Deem Home 4",
        "Deem Home 6", "Deem Home 7", "Deem Home A10",
    }
    for item in السويدي:
        return "حي السويدي"

    النزهة = {
        "شقة فاخرة بغرفة نوم واحدة", "شقة بموقع مميز و بتصميم جميل ودخول ذكي",
    }
    for item in النزهة:
        return "حي النزهة"

    بنبان = {
        "شالية منتجع دبل نايت - 4", "شالية منتجع دبل نايت - 7", "بيت قولدن ويف", "شقه غرفتين وصاله خمس نجوم",
        "مكان جميل للاستمتاع بالوقت !",
    }
    for item in بنبان:
        return "حي بنبان"

    القيروان = {
        "Homy Studio", "KAGE.1 شقة مع مدخل خاص - شقة بمدخل خاص", "شقة فاخرة - دخول ذكي LUXURY APARTMENT",
        "KAGE.2 شقة مع مدخل خاص - شقة بمدخل خاص", "شقة فاخرة مطلة على المدينة", "Town 7 New Apartment",
    }
    for item in القيروان:
        return "حي القيروان"

    المروج = {
        "شقة سحب غرف نوم وحمام واحد K4",
    }
    for item in المروج:
        return "حي المروج"

    غرناطة = {
        "استوديو جديد بشرفة واطلالة مميزة", "شقة هادئة جميلة", "شقة بتصميم جميل في مجمع العجلان"
    }
    for item in غرناطة:
        return "حي غرناطة"

    الملك_سلمان = {
        "Sachi Stays U4 (غرفة السينما والصالة الرياضية وحمام السباحة)", "إقامات ساتشي تعمل (عش مريح)", "Kease Kingسل S -6 Lusso Najd XZ90",
    }
    for item in الملك_سلمان:
        return "حي الملك سلمان"

    أم_الحمام_الغربي = {
        "شقة فندقية دور كامل بفيلا بسطح ومدخل خاص",
    }
    for item in أم_الحمام_الغربي:
        return "حي أم الحمام الغربي"

    العقيق = {
        "الشقه جديدة و هادئه ومميزه قريبه من البوليفارد", "GR-شقة معاصره و حديثة من 3 غرف نوم.", "bnbmehomes | 3BR w/ Pvt Terrace | nr Kingdom Arena",
        "Luxury apartment شقة راقية", "الشقة الانيقه دخول ذاتي و ذكي", "شقة مودرن بجانب موسم الرياض 6", "راحتكم غايتنا.",
        "استوديو قريب من البوليفارد بدخول ذاتي 2ب-م", "Livedin | شقة أنيقة بغرفة نوم واحدة بالقرب من KAFD",
    }
    for item in العقيق:
        return "حي العقيق"

    العارض = {
        "أكثر من مجرد شقة", "شقة فندقية وأنيقة في التعميير 12", "الراقية", "شقة فخمة في شمال الرياض", "مسكنك الخاص"
    }
    for item in العارض:
        return "حي العارض"

    النرجس = {
        "شقة هادئة بموقع مثالي", "شقة أنيقة لحياة عصرية", "شقة راقية من غرفتين نوم", "سوبر لاكشري 11",
    }
    for item in النرجس:
        return "حي النرجس"

    المونسية = {
        "شقة في مشروع مكين جديدة وجميلة", "شقة فاخرة و كبيرة بتصميم فندقي # G 211", "شقة فاخرة كبيرة مع دخول ذاتي # G 304",
        "شقة بتصميم مودرن", "شقة مودرن مع نافذة مطلة و دخول ذاتي# G 206",
    }
    for item in المونسية:
        return "حي المونسية"

    الربيع = {
        "المجدية | الدخول الذاتي |الرابي", "C3 - شقة فاخرة بمدخل خاص",
    }
    for item in الربيع:
        return "حي الربيع"

    ظهرة_لبن = {
        "شقه كبيره راقيه جداً", "شقة فندقية دخول ذاتي"
    }
    for item in ظهرة_لبن:
        return "ظهرة لبن"

    حطين = {
        "بنتهاوس يوناني مع جاكوزي وشوي سطح", "شقة بإطلالة رائعة بحي استراتيجي", "Wasf 2A", "شقة كبيرة | تسجيل وصول ذاتي. (صالة ألعاب رياضية وحمام سباحة) تلفزيون ذكي."
        "شقة هاڤين أوف نيرڤانا 5B", "شقة Billiard garden مع مدخل خاص 03", "GR- شقة أنيقة من 3 غرف نوم في قلب الرياض",
    }
    for item in حطين:
        return "حي حطين"

    الخالدية = {
        "شقة دخول ذاتي مودرن قرب بوليفارد",
    }
    for item in الخالدية:
        return "حي الخالدية"

    الروضة = {
        "شقة غرفة و صالة خاصة انيقة ٣٠٤", "تنفيذي ثمانية بالتوازي", "شقة غرفة و صالة انيقة 301مخرج ١٣",
    }
    for item in الروضة:
        return "حي الروضة"

    الفلاح = {
        "غرفة وصالة أنيقة وراقية",
    }
    for item in الفلاح:
        return "حي الفلاح"

    المغرزات = {
        "A -8 شقة فاخرة حديثة",
    }
    for item in المغرزات:
        return "حي المغرزات"

    الاندلس = {
        "شقه مودرن فاخره بتسجيل دخول ذاتي",
    }
    for item in الاندلس:
        return "حي الاندلس"

    السليمانية = {
        "تسجيل الوصول الذاتي على الطراز البوهيمي 16", "مبات - منتجع اوشيانا - 463",
    }
    for item in السليمانية:
        return "حي السليمانية"

    الياسمين = {
        "استوديو",
    }
    for item in الياسمين:
        return "حي الياسمين"

    المصيف = {
        "مدخل ذكي مريح للشقة", "مدخل خاص للشقة الكبيرة",
    }
    for item in المصيف:
        return "حي المصيف"

    النفل = {
        "S2 | استوديو فاخر", "4 | Luxury Apartment شقة بثلاث غرف نوم-دخول ذكي", "3 | Luxury Apartment شقة بثلاث غرف نوم-دخول ذكي"
    }
    for item in النفل:
        return "حي النفل"

    الوادي = {
        "مدخل خاص | شرفة خارجية",
    }
    for item in الوادي:
        return "حي الوادي"

    النهضة = {
        "(3-5) شقه فاخرة مكونة من 3 غرف نوم وصاله ومطبخ"
    }
    for item in النهضة:
        return "حي النهضة"

    الجنادرية = {
        "بوابة الشرق"
    }
    for item in الجنادرية:
        return "حي الجنادرية"

    العريجاء = {
        "شقة واسعة 3 غرف ترفيه بلاستيشن 5"
    }
    for item in العريجاء:
        return "حي العريجاء"

    الهدا = {
        "جناح أنيق في الوسط 1"
    }
    for item in الهدا:
        return "حي الهدا"

    القدس = {
        "شقة بتصميم رائع ثلاث غرف نوم وصاله كبيره دخول ذاتي"
    }
    for item in القدس:
        return "حي القدس"

    return district

# SAVE NEW DATA IN DISTRICT AND PRICE
df['Price'] = df['Price'].apply(clean_price)
df['District'] = df.apply(clean_district, axis=1)

# DROP NULL ROWS
df.dropna(subset=['District'], inplace=True)

# REMOVE COLUMN 'URL' IF IT EXISTS
if 'URL' in df.columns:
    df.drop(columns=['URL'], inplace=True)

# OUTPUT FILE (CHANGEABLE)
output_file = '../Datasets/(12) December/Cleaned_AirBnB_Riyadh_(12)December_Bedroom(3).xlsx'
df.to_excel(output_file, index=False)
print("CLEANING IS DONE AND SAVED")
print(f"DATA SAVED TO {output_file}")